### data
* temperature
* rainfall
* wind
* humidity

In [240]:
import pandas as pd

## 기온 데이터 불러오기

In [241]:
temperature = pd.read_csv("../CSV/목포_기온_utf_8.csv", header = 10)

In [242]:
temperature.head(3)

,\t\t지점번호,지점명,일시,평균기온(℃),최고기온(℃),\t최고기온시각,최저기온(℃),최저기온시각일교차,Unnamed: 8
0,\t\t165,목포,2011.1.1,-3.7,-0.2,14:12,-6.0,8:17,5.8
1,\t\t165,목포,2011.1.2,-2.4,2.0,13:07,-5.7,6:11,7.7
2,\t\t165,목포,2011.1.3,-1.6,1.4,11:59,-3.8,23:19,5.2

In [243]:
temperature.columns

Index(['\t\t지점번호', '지점명', '일시', '평균기온(℃)', '최고기온(℃)', '\t최고기온시각', '최저기온(℃)',
       '최저기온시각일교차', 'Unnamed: 8'],
      dtype='object')

### 컬럼명 수정

In [244]:
temperature.columns = ['지점번호', '지점명', '일시', '평균기온(℃)', '최고기온(℃)', '최고기온시각', '최저기온(℃)',
       '최저기온시각', '일교차']

In [245]:
temperature.head(3)

      지점번호 지점명        일시  평균기온(℃)  최고기온(℃) 최고기온시각  최저기온(℃) 최저기온시각  일교차
0  \t\t165  목포  2011.1.1     -3.7     -0.2  14:12     -6.0   8:17  5.8
1  \t\t165  목포  2011.1.2     -2.4      2.0  13:07     -5.7   6:11  7.7
2  \t\t165  목포  2011.1.3     -1.6      1.4  11:59     -3.8  23:19  5.2

### 결측치 확인

In [246]:
temperature.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3953 entries, 0 to 3952
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지점번호     3953 non-null   object
 1   지점명      3945 non-null   object
 2   일시       3945 non-null   object
 3   평균기온(℃)  3945 non-null   float64
 4   최고기온(℃)  3944 non-null   float64
 5   최고기온시각   3945 non-null   object
 6   최저기온(℃)  3944 non-null   float64
 7   최저기온시각   3945 non-null   object
 8   일교차      3943 non-null   float64
dtypes: float64(4), object(5)
memory usage: 278.1+ KB

### 일시 기준으로 결측치 제거

In [247]:
temperature.dropna(subset = ["일시"], axis = 0, inplace = True)

In [248]:
temperature.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지점번호     3945 non-null   object
 1   지점명      3945 non-null   object
 2   일시       3945 non-null   object
 3   평균기온(℃)  3945 non-null   float64
 4   최고기온(℃)  3944 non-null   float64
 5   최고기온시각   3945 non-null   object
 6   최저기온(℃)  3944 non-null   float64
 7   최저기온시각   3945 non-null   object
 8   일교차      3943 non-null   float64
dtypes: float64(4), object(5)
memory usage: 308.2+ KB

### 앞의 데이터로 결측치 대체

In [249]:
### 최저기온 결측치 -> 평균으로 대체
# temperature.fillna({"최저기온(℃)" : temperature["최저기온(℃)"].mean()}, inplace = True)
temperature.fillna(method = "ffill", inplace = True)

In [250]:
temperature.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지점번호     3945 non-null   object
 1   지점명      3945 non-null   object
 2   일시       3945 non-null   object
 3   평균기온(℃)  3945 non-null   float64
 4   최고기온(℃)  3945 non-null   float64
 5   최고기온시각   3945 non-null   object
 6   최저기온(℃)  3945 non-null   float64
 7   최저기온시각   3945 non-null   object
 8   일교차      3945 non-null   float64
dtypes: float64(4), object(5)
memory usage: 308.2+ KB

In [251]:
### 결측치 0으로 대체
# temperature.fillna(0, inplace = True)

In [252]:
temperature.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지점번호     3945 non-null   object
 1   지점명      3945 non-null   object
 2   일시       3945 non-null   object
 3   평균기온(℃)  3945 non-null   float64
 4   최고기온(℃)  3945 non-null   float64
 5   최고기온시각   3945 non-null   object
 6   최저기온(℃)  3945 non-null   float64
 7   최저기온시각   3945 non-null   object
 8   일교차      3945 non-null   float64
dtypes: float64(4), object(5)
memory usage: 308.2+ KB

### 일시 datetime 타입으로 변환

In [253]:
temperature["일시"] = pd.to_datetime(temperature["일시"])

In [254]:
temperature.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지점번호     3945 non-null   object
 1   지점명      3945 non-null   object
 2   일시       3945 non-null   datetime64[ns]
 3   평균기온(℃)  3945 non-null   float64
 4   최고기온(℃)  3945 non-null   float64
 5   최고기온시각   3945 non-null   object
 6   최저기온(℃)  3945 non-null   float64
 7   최저기온시각   3945 non-null   object
 8   일교차      3945 non-null   float64
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 308.2+ KB

## 강수량 데이터 불러오기

In [255]:
rainfall = pd.read_csv("../CSV/목포_강수량_utf_8.csv", header = 11)

In [256]:
rainfall.head(3)

  \t지점번호 지점명        일시  강수량(mm)  1시간최다강수량(mm) 1시간최다강수량시각
0  \t165  목포  2011.1.1      1.3           NaN        NaN
1  \t165  목포  2011.1.2      NaN           NaN        NaN
2  \t165  목포  2011.1.3      NaN           NaN        NaN

In [257]:
rainfall.columns

Index(['\t지점번호', '지점명', '일시', '강수량(mm)', '1시간최다강수량(mm)', '1시간최다강수량시각'], dtype='object')

### 컬럼명 수정

In [258]:
rainfall.columns = ['지점번호', '지점명', '일시', '강수량(mm)', '1시간최다강수량(mm)', '1시간최다강수량시각']

In [259]:
rainfall.head(3)

    지점번호 지점명        일시  강수량(mm)  1시간최다강수량(mm) 1시간최다강수량시각
0  \t165  목포  2011.1.1      1.3           NaN        NaN
1  \t165  목포  2011.1.2      NaN           NaN        NaN
2  \t165  목포  2011.1.3      NaN           NaN        NaN

### 결측치 확인

In [260]:
rainfall.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3951 entries, 0 to 3950
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   지점번호          3951 non-null   object
 1   지점명           3945 non-null   object
 2   일시            3945 non-null   object
 3   강수량(mm)       1583 non-null   float64
 4   1시간최다강수량(mm)  887 non-null    float64
 5   1시간최다강수량시각    632 non-null    object
dtypes: float64(2), object(4)
memory usage: 185.3+ KB

### 일시 기준으로 결측치 제거

In [261]:
rainfall.dropna(subset = ["일시"], axis = 0, inplace = True)

In [262]:
rainfall.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   지점번호          3945 non-null   object
 1   지점명           3945 non-null   object
 2   일시            3945 non-null   object
 3   강수량(mm)       1583 non-null   float64
 4   1시간최다강수량(mm)  887 non-null    float64
 5   1시간최다강수량시각    632 non-null    object
dtypes: float64(2), object(4)
memory usage: 215.7+ KB

### 결측치 0으로 대체

In [263]:
rainfall.fillna(0, inplace = True)

In [264]:
rainfall.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   지점번호          3945 non-null   object
 1   지점명           3945 non-null   object
 2   일시            3945 non-null   object
 3   강수량(mm)       3945 non-null   float64
 4   1시간최다강수량(mm)  3945 non-null   float64
 5   1시간최다강수량시각    3945 non-null   object
dtypes: float64(2), object(4)
memory usage: 215.7+ KB

### 일시 datetime 타입으로 변환

In [265]:
rainfall["일시"] = pd.to_datetime(rainfall["일시"])

In [266]:
rainfall.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   지점번호          3945 non-null   object
 1   지점명           3945 non-null   object
 2   일시            3945 non-null   datetime64[ns]
 3   강수량(mm)       3945 non-null   float64
 4   1시간최다강수량(mm)  3945 non-null   float64
 5   1시간최다강수량시각    3945 non-null   object
dtypes: datetime64[ns](1), float64(2), object(3)
memory usage: 215.7+ KB

### 지점번호, 지점명 컬럼 삭제

In [267]:
rainfall.drop(["지점번호", "지점명"], axis = 1, inplace = True)

In [268]:
rainfall.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   일시            3945 non-null   datetime64[ns]
 1   강수량(mm)       3945 non-null   float64
 2   1시간최다강수량(mm)  3945 non-null   float64
 3   1시간최다강수량시각    3945 non-null   object
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 154.1+ KB

## 바람 데이터 불러오기

In [269]:
wind = pd.read_csv("../CSV/목포_바람_utf_8.csv", header = 14)

In [270]:
wind.head(3)

,\t\t지점번호,지점명,일시,평균풍속(m/s),최대풍속(m/s),최대풍속풍향(deg),\t최대풍속시각,최대순간풍속(m/s),최대순간풍속풍향(deg),\t최대순간풍속시각
0,\t\t165,목포,2011.1.1,2.1,6.6,360.0,13:25,9.9,20.0,15:22
1,\t\t165,목포,2011.1.2,2.2,7.8,360.0,15:36,11.2,360.0,15:28
2,\t\t165,목포,2011.1.3,2.9,6.5,360.0,15:14,8.9,360.0,15:13

In [271]:
wind.columns

Index(['\t\t지점번호', '지점명', '일시', '평균풍속(m/s)', '최대풍속(m/s)', '최대풍속풍향(deg)',
       '\t최대풍속시각', '최대순간풍속(m/s)', '최대순간풍속풍향(deg)', '\t최대순간풍속시각'],
      dtype='object')

### 컬럼명 수정

In [272]:
wind.columns = ['지점번호', '지점명', '일시', '평균풍속(m/s)', '최대풍속(m/s)', '최대풍속풍향(deg)',
       '최대풍속시각', '최대순간풍속(m/s)', '최대순간풍속풍향(deg)', '최대순간풍속시각']

In [273]:
wind.head(3)

,지점번호,지점명,일시,평균풍속(m/s),최대풍속(m/s),최대풍속풍향(deg),최대풍속시각,최대순간풍속(m/s),최대순간풍속풍향(deg),최대순간풍속시각
0,\t\t165,목포,2011.1.1,2.1,6.6,360.0,13:25,9.9,20.0,15:22
1,\t\t165,목포,2011.1.2,2.2,7.8,360.0,15:36,11.2,360.0,15:28
2,\t\t165,목포,2011.1.3,2.9,6.5,360.0,15:14,8.9,360.0,15:13

### 결측치 확인

In [274]:
wind.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3949 entries, 0 to 3948
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지점번호           3949 non-null   object
 1   지점명            3945 non-null   object
 2   일시             3945 non-null   object
 3   평균풍속(m/s)      3945 non-null   float64
 4   최대풍속(m/s)      3945 non-null   float64
 5   최대풍속풍향(deg)    3945 non-null   float64
 6   최대풍속시각         3945 non-null   object
 7   최대순간풍속(m/s)    3945 non-null   float64
 8   최대순간풍속풍향(deg)  3945 non-null   float64
 9   최대순간풍속시각       3945 non-null   object
dtypes: float64(5), object(5)
memory usage: 308.6+ KB

### 일시 기준으로 결측치 제거

In [275]:
wind.dropna(subset = ["일시"], axis = 0, inplace = True)

In [276]:
wind.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지점번호           3945 non-null   object
 1   지점명            3945 non-null   object
 2   일시             3945 non-null   object
 3   평균풍속(m/s)      3945 non-null   float64
 4   최대풍속(m/s)      3945 non-null   float64
 5   최대풍속풍향(deg)    3945 non-null   float64
 6   최대풍속시각         3945 non-null   object
 7   최대순간풍속(m/s)    3945 non-null   float64
 8   최대순간풍속풍향(deg)  3945 non-null   float64
 9   최대순간풍속시각       3945 non-null   object
dtypes: float64(5), object(5)
memory usage: 339.0+ KB

### 일시 datetime 타입으로 변환

In [277]:
wind["일시"] = pd.to_datetime(wind["일시"])

In [278]:
wind.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지점번호           3945 non-null   object
 1   지점명            3945 non-null   object
 2   일시             3945 non-null   datetime64[ns]
 3   평균풍속(m/s)      3945 non-null   float64
 4   최대풍속(m/s)      3945 non-null   float64
 5   최대풍속풍향(deg)    3945 non-null   float64
 6   최대풍속시각         3945 non-null   object
 7   최대순간풍속(m/s)    3945 non-null   float64
 8   최대순간풍속풍향(deg)  3945 non-null   float64
 9   최대순간풍속시각       3945 non-null   object
dtypes: datetime64[ns](1), float64(5), object(4)
memory usage: 339.0+ KB

### 지점번호, 지점명 컬럼 삭제

In [279]:
wind.drop(["지점번호", "지점명"], axis = 1, inplace = True)

In [280]:
wind.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   일시             3945 non-null   datetime64[ns]
 1   평균풍속(m/s)      3945 non-null   float64
 2   최대풍속(m/s)      3945 non-null   float64
 3   최대풍속풍향(deg)    3945 non-null   float64
 4   최대풍속시각         3945 non-null   object
 5   최대순간풍속(m/s)    3945 non-null   float64
 6   최대순간풍속풍향(deg)  3945 non-null   float64
 7   최대순간풍속시각       3945 non-null   object
dtypes: datetime64[ns](1), float64(5), object(2)
memory usage: 277.4+ KB

## 습도 데이터 불러오기

In [281]:
humidity = pd.read_csv("../CSV/목포_습도_utf_8.csv", header = 15)

In [282]:
humidity.head(3)

  \t\t지점번호 지점명        일시  평균습도(%rh)  최저습도(%rh)
0  \t\t165  목포  2011.1.1       91.6       77.0
1  \t\t165  목포  2011.1.2       86.6       61.0
2  \t\t165  목포  2011.1.3       81.4       61.0

In [283]:
humidity.columns

Index(['\t\t지점번호', '지점명', '일시', '평균습도(%rh)', '최저습도(%rh)'], dtype='object')

### 컬럼명 수정

In [284]:
humidity.columns = ['지점번호', '지점명', '일시', '평균습도(%rh)', '최저습도(%rh)']

In [285]:
humidity.head(3)

      지점번호 지점명        일시  평균습도(%rh)  최저습도(%rh)
0  \t\t165  목포  2011.1.1       91.6       77.0
1  \t\t165  목포  2011.1.2       86.6       61.0
2  \t\t165  목포  2011.1.3       81.4       61.0

### 결측치 확인

In [286]:
humidity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3948 entries, 0 to 3947
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   지점번호       3948 non-null   object
 1   지점명        3945 non-null   object
 2   일시         3945 non-null   object
 3   평균습도(%rh)  3943 non-null   float64
 4   최저습도(%rh)  3945 non-null   float64
dtypes: float64(2), object(3)
memory usage: 154.3+ KB

### 일시 기준으로 결측치 제거

In [287]:
humidity.dropna(subset = ["일시"], axis = 0, inplace = True)

In [288]:
humidity.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   지점번호       3945 non-null   object
 1   지점명        3945 non-null   object
 2   일시         3945 non-null   object
 3   평균습도(%rh)  3943 non-null   float64
 4   최저습도(%rh)  3945 non-null   float64
dtypes: float64(2), object(3)
memory usage: 184.9+ KB

### 앞의 데이터로 결측치 대체

In [289]:
### 결측치 0으로 대체
# humidity.fillna(0, inplace = True)
humidity.fillna(method = "ffill", inplace = True)

In [290]:
humidity.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   지점번호       3945 non-null   object
 1   지점명        3945 non-null   object
 2   일시         3945 non-null   object
 3   평균습도(%rh)  3945 non-null   float64
 4   최저습도(%rh)  3945 non-null   float64
dtypes: float64(2), object(3)
memory usage: 184.9+ KB

### 일시 datetime 타입으로 변환

In [291]:
humidity["일시"] = pd.to_datetime(humidity["일시"])

In [292]:
humidity.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   지점번호       3945 non-null   object
 1   지점명        3945 non-null   object
 2   일시         3945 non-null   datetime64[ns]
 3   평균습도(%rh)  3945 non-null   float64
 4   최저습도(%rh)  3945 non-null   float64
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 184.9+ KB

### 지점번호, 지점명 컬럼 삭제

In [293]:
humidity.drop(["지점번호", "지점명"], axis = 1, inplace = True)

In [294]:
humidity.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   일시         3945 non-null   datetime64[ns]
 1   평균습도(%rh)  3945 non-null   float64
 2   최저습도(%rh)  3945 non-null   float64
dtypes: datetime64[ns](1), float64(2)
memory usage: 123.3 KB

### data shape 확인

In [295]:
print("temperature shape : {}".format(temperature.shape))
print("rainfall shape : {}".format(rainfall.shape))
print("wind shape : {}".format(wind.shape))
print("humidity shape : {}".format(humidity.shape))

temperature shape : (3945, 9)
rainfall shape : (3945, 4)
wind shape : (3945, 8)
humidity shape : (3945, 3)

## temperature, rainfall, wind, humidity merge

In [296]:
data_merge = pd.merge(temperature, rainfall, on = "일시")

In [300]:
data_merge = data_merge.merge(wind, on = "일시")

In [304]:
data_merge = data_merge.merge(humidity, on = "일시")

In [305]:
data_merge.head(3)

,지점번호,지점명,일시,평균기온(℃),최고기온(℃),최고기온시각,최저기온(℃),최저기온시각,일교차,강수량(mm),...,1시간최다강수량시각,평균풍속(m/s),최대풍속(m/s),최대풍속풍향(deg),최대풍속시각,최대순간풍속(m/s),최대순간풍속풍향(deg),최대순간풍속시각,평균습도(%rh),최저습도(%rh)
0,\t\t165,목포,2011-01-01,-3.7,-0.2,14:12,-6.0,8:17,5.8,1.3,...,0,2.1,6.6,360.0,13:25,9.9,20.0,15:22,91.6,77.0
1,\t\t165,목포,2011-01-02,-2.4,2.0,13:07,-5.7,6:11,7.7,0.0,...,0,2.2,7.8,360.0,15:36,11.2,360.0,15:28,86.6,61.0
2,\t\t165,목포,2011-01-03,-1.6,1.4,11:59,-3.8,23:19,5.2,0.0,...,0,2.9,6.5,360.0,15:14,8.9,360.0,15:13,81.4,61.0

In [309]:
data_merge.tail(5)

,지점번호,지점명,일시,평균기온(℃),최고기온(℃),최고기온시각,최저기온(℃),최저기온시각,일교차,강수량(mm),...,1시간최다강수량시각,평균풍속(m/s),최대풍속(m/s),최대풍속풍향(deg),최대풍속시각,최대순간풍속(m/s),최대순간풍속풍향(deg),최대순간풍속시각,평균습도(%rh),최저습도(%rh)
3940,\t\t165,목포,2021-10-15,19.6,23.2,13:45,16.5,21:38,6.7,4.3,...,20:50,4.3,8.7,360.0,18:20,11.1,360.0,18:26,81.9,61.0
3941,\t\t165,목포,2021-10-16,14.5,17.8,11:11,11.4,23:57,6.4,3.5,...,2:04,8.7,14.9,360.0,23:28,19.1,360.0,23:28,67.8,50.0
3942,\t\t165,목포,2021-10-17,8.8,12.0,15:21,5.6,7:08,6.4,0.0,...,0,7.2,13.9,360.0,0:04,18.0,20.0,0:01,52.5,38.0
3943,\t\t165,목포,2021-10-18,11.7,16.6,15:04,6.0,7:15,10.6,0.0,...,0,2.9,5.3,340.0,16:04,7.2,360.0,16:02,50.8,37.0
3944,\t\t165,목포,2021-10-19,13.3,16.6,13:48,10.8,7:04,5.8,3.6,...,6:09,4.0,9.4,340.0,16:08,13.5,340.0,16:05,70.3,51.0

In [306]:
data_merge.shape

(3945, 21)

In [307]:
data_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지점번호           3945 non-null   object
 1   지점명            3945 non-null   object
 2   일시             3945 non-null   datetime64[ns]
 3   평균기온(℃)        3945 non-null   float64
 4   최고기온(℃)        3945 non-null   float64
 5   최고기온시각         3945 non-null   object
 6   최저기온(℃)        3945 non-null   float64
 7   최저기온시각         3945 non-null   object
 8   일교차            3945 non-null   float64
 9   강수량(mm)        3945 non-null   float64
 10  1시간최다강수량(mm)   3945 non-null   float64
 11  1시간최다강수량시각     3945 non-null   object
 12  평균풍속(m/s)      3945 non-null   float64
 13  최대풍속(m/s)      3945 non-null   float64
 14  최대풍속풍향(deg)    3945 non-null   float64
 15  최대풍속시각         3945 non-null   object
 16  최대순간풍속(m/s)    3945 non-null   float64
 17  최대순간풍속풍향(deg)  3945 non-null   float64
 18  최대순간풍속시각       3945 non-null   object
 19  평균습도(%rh)      3945 non-null   float64
 20  최저습도(%rh)      3945 non-null   float64
dtypes: datetime64[ns](1), float64(13), object(7)
memory usage: 678.0+ KB

## CSV 파일로 저장
* index 제거

In [310]:
data_merge.to_csv("../CSV/weather.csv", index = False)

## 고구마 가격 데이터 불러오기

In [392]:
# item = pd.read_excel("../EXCEL/고구마_가격_2011.xls")
item = pd.read_csv("../CSV/고구마_가격_2011.csv", header = None)

In [393]:
item.head(10)

,0,1,2,3,4,5,6,7,8,9,...,239,240,241,242,243,244,245,246,247,248
0,구분,1월 3일,1월 4일,1월 5일,1월 6일,1월 7일,1월 10일,1월 11일,1월 12일,1월 13일,...,12월 19일,12월 20일,12월 21일,12월 22일,12월 23일,12월 26일,12월 27일,12월 28일,12월 29일,12월 30일
1,평균,"25,600","25,600","25,600","26,600","26,800","27,200","27,200","29,400","29,400",...,"31,000","31,000","31,000","31,000","31,000","31,000","30,400","30,400","30,000","30,000"
2,평년,"16,500","16,593","16,820","17,063","17,217","17,637","17,707","17,813","17,910",...,"17,300","17,340","17,440","17,547","17,657","17,770","17,780","17,797","17,800","17,927"
3,서울,"30,000","30,000","30,000","30,000","30,000","32,000","32,000","35,000","35,000",...,"33,000","33,000","33,000","33,000","33,000","33,000","33,000","33,000","33,000","33,000"
4,부산,"23,000","23,000","23,000","24,000","25,000","25,000","25,000","27,000","27,000",...,"30,000","30,000","30,000","30,000","30,000","30,000","30,000","30,000","30,000","30,000"
5,대구,"24,000","24,000","24,000","26,000","26,000","26,000","26,000","28,000","28,000",...,"31,000","31,000","31,000","31,000","31,000","31,000","31,000","31,000","31,000","31,000"
6,광주,"24,000","24,000","24,000","24,000","24,000","24,000","24,000","27,000","27,000",...,"28,000","28,000","28,000","28,000","28,000","28,000","28,000","28,000","26,000","26,000"
7,대전,"27,000","27,000","27,000","29,000","29,000","29,000","29,000","30,000","30,000",...,"33,000","33,000","33,000","33,000","33,000","33,000","30,000","30,000","30,000","30,000"

In [394]:
item = item.transpose()

In [395]:
item.head(3)

       0       1       2       3       4       5       6       7
0     구분      평균      평년      서울      부산      대구      광주      대전
1  1월 3일  25,600  16,500  30,000  23,000  24,000  24,000  27,000
2  1월 4일  25,600  16,593  30,000  23,000  24,000  24,000  27,000

In [396]:
item.columns = ["일시", "평균", "평년", "서울", "부산", "대구", "광주", "대전"]

In [397]:
item.head(3)

      일시      평균      평년      서울      부산      대구      광주      대전
0     구분      평균      평년      서울      부산      대구      광주      대전
1  1월 3일  25,600  16,500  30,000  23,000  24,000  24,000  27,000
2  1월 4일  25,600  16,593  30,000  23,000  24,000  24,000  27,000

In [398]:
item.drop(0, axis = 0, inplace = True)

In [399]:
item.head(3)

      일시      평균      평년      서울      부산      대구      광주      대전
1  1월 3일  25,600  16,500  30,000  23,000  24,000  24,000  27,000
2  1월 4일  25,600  16,593  30,000  23,000  24,000  24,000  27,000
3  1월 5일  25,600  16,820  30,000  23,000  24,000  24,000  27,000

In [400]:
item.reset_index(drop = True, inplace = True)

In [401]:
item.head(3)

      일시      평균      평년      서울      부산      대구      광주      대전
0  1월 3일  25,600  16,500  30,000  23,000  24,000  24,000  27,000
1  1월 4일  25,600  16,593  30,000  23,000  24,000  24,000  27,000
2  1월 5일  25,600  16,820  30,000  23,000  24,000  24,000  27,000

In [403]:
item["year"] = "2011"

In [404]:
item["month"] = item["일시"].str.split("월", expand = True)[0]

In [405]:
item["day"] = item["일시"].str.split("월", expand = True)[1].str.split("일", expand = True)[0]
item["day"] = item["day"].str.lstrip() # 앞 공백 제거

In [406]:
item.head(3)

,일시,평균,평년,서울,부산,대구,광주,대전,year,month,day
0,1월 3일,"25,600","16,500","30,000","23,000","24,000","24,000","27,000",2011,1,3
1,1월 4일,"25,600","16,593","30,000","23,000","24,000","24,000","27,000",2011,1,4
2,1월 5일,"25,600","16,820","30,000","23,000","24,000","24,000","27,000",2011,1,5

In [415]:
item["일시"] = item["year"] + "-" + item["month"] + "-" + item["day"]

In [416]:
# if len(item["month"].values) == 1 :
#     if len(item["day".values]) == 1 :  
#         item["일시"] = item["year"] + "0" + item["month"] + "0" + item["day"]
#     else :
#         item["일시"] = item["year"] + "0" + item["month"] + item["day"]
# else :
#     item["일시"] = item["year"] + item["month"] + item["day"]

In [417]:
item.head(3)

,일시,평균,평년,서울,부산,대구,광주,대전,year,month,day
0,2011-1-3,"25,600","16,500","30,000","23,000","24,000","24,000","27,000",2011,1,3
1,2011-1-4,"25,600","16,593","30,000","23,000","24,000","24,000","27,000",2011,1,4
2,2011-1-5,"25,600","16,820","30,000","23,000","24,000","24,000","27,000",2011,1,5

In [419]:
item["일시"] = pd.to_datetime(item["일시"])

In [422]:
item.head(3)

,일시,평균,평년,서울,부산,대구,광주,대전,year,month,day
0,2011-01-03,"25,600","16,500","30,000","23,000","24,000","24,000","27,000",2011,1,3
1,2011-01-04,"25,600","16,593","30,000","23,000","24,000","24,000","27,000",2011,1,4
2,2011-01-05,"25,600","16,820","30,000","23,000","24,000","24,000","27,000",2011,1,5

In [423]:
item.shape

(248, 11)

In [424]:
item.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      248 non-null    datetime64[ns]
 1   평균      248 non-null    object
 2   평년      248 non-null    object
 3   서울      248 non-null    object
 4   부산      248 non-null    object
 5   대구      248 non-null    object
 6   광주      248 non-null    object
 7   대전      248 non-null    object
 8   year    248 non-null    object
 9   month   248 non-null    object
 10  day     248 non-null    object
dtypes: datetime64[ns](1), object(10)
memory usage: 21.4+ KB

In [425]:
price_merge = item.copy()

In [426]:
price_merge.shape

(248, 11)

In [427]:
for i in range(2012, 2022, 1) :
    price = pd.read_csv(f"../CSV/고구마_가격_{i}.csv", header = None)
    price = price.transpose()
    price.columns = ["일시", "평균", "평년", "서울", "부산", "대구", "광주", "대전"]
    price.drop(0, axis = 0, inplace = True)
    price.reset_index(drop = True, inplace = True)

    price["year"] = f"{i}"
    price["month"] = price["일시"].str.split("월", expand = True)[0]
    price["day"] = price["일시"].str.split("월", expand = True)[1].str.split("일", expand = True)[0]
    price["day"] = price["day"].str.lstrip() # 앞 공백 제거

    price["일시"] = price["year"] + "-" + price["month"] + "-" + price["day"]
    price["일시"] = pd.to_datetime(price["일시"])
    price_merge = pd.concat([price_merge, price], ignore_index = True)
    print("price shape {} : {}".format(i, price.shape))

price shape 2012 : (249, 11)
price shape 2013 : (248, 11)
price shape 2014 : (243, 11)
price shape 2015 : (248, 11)
price shape 2016 : (246, 11)
price shape 2017 : (243, 11)
price shape 2018 : (244, 11)
price shape 2019 : (246, 11)
price shape 2020 : (248, 11)
price shape 2021 : (196, 11)

In [428]:
price_merge.shape

(2659, 11)

In [429]:
price_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2659 entries, 0 to 2658
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      2659 non-null   datetime64[ns]
 1   평균      2659 non-null   object
 2   평년      2659 non-null   object
 3   서울      2659 non-null   object
 4   부산      2659 non-null   object
 5   대구      2659 non-null   object
 6   광주      2659 non-null   object
 7   대전      2659 non-null   object
 8   year    2659 non-null   object
 9   month   2659 non-null   object
 10  day     2659 non-null   object
dtypes: datetime64[ns](1), object(10)
memory usage: 228.6+ KB

In [430]:
price_merge[price_merge["일시"].isnull()]

Empty DataFrame
Columns: [일시, 평균, 평년, 서울, 부산, 대구, 광주, 대전, year, month, day]
Index: []

In [431]:
price_merge.head(3)

,일시,평균,평년,서울,부산,대구,광주,대전,year,month,day
0,2011-01-03,"25,600","16,500","30,000","23,000","24,000","24,000","27,000",2011,1,3
1,2011-01-04,"25,600","16,593","30,000","23,000","24,000","24,000","27,000",2011,1,4
2,2011-01-05,"25,600","16,820","30,000","23,000","24,000","24,000","27,000",2011,1,5

In [432]:
price_merge[price_merge["부산"] == "-"]

,일시,평균,평년,서울,부산,대구,광주,대전,year,month,day
2231,2020-01-28,"27,000","28,263","28,000",-,"27,000","27,000","26,000",2020,1,28

In [434]:
print("2021-01-27 부산 가격 : {}".format(price_merge.iloc[2230, 4]))
price_merge.iloc[2231, 4] = price_merge.iloc[2230, 4]

2021-01-27 부산 가격 : 26,000

In [435]:
price_merge.loc[2229: 2233, :]

,일시,평균,평년,서울,부산,대구,광주,대전,year,month,day
2229,2020-01-22,"26,800","27,833","28,000","26,000","27,000","27,000","26,000",2020,1,22
2230,2020-01-23,"26,400","27,897","28,000","26,000","26,000","26,000","26,000",2020,1,23
2231,2020-01-28,"27,000","28,263","28,000","26,000","27,000","27,000","26,000",2020,1,28
2232,2020-01-29,"26,400","28,553","28,000","26,000","26,000","26,000","26,000",2020,1,29
2233,2020-01-30,"25,800","28,767","28,000","25,000","26,000","25,000","25,000",2020,1,30

In [436]:
price_merge[price_merge["광주"] == "-"]

,일시,평균,평년,서울,부산,대구,광주,대전,year,month,day
2249,2020-02-21,"25,250","28,640","26,000","25,000","25,000",-,"25,000",2020,2,21
2250,2020-02-24,"25,250","28,900","26,000","25,000","25,000",-,"25,000",2020,2,24
2251,2020-02-25,"27,250","28,960","28,000","29,000","25,000",-,"27,000",2020,2,25
2252,2020-02-26,"30,750","29,100","31,000","33,000","30,000",-,"29,000",2020,2,26
2253,2020-02-27,"33,750","29,273","33,000","36,000","35,000",-,"31,000",2020,2,27
2254,2020-02-28,"35,000","29,507","35,000","36,000","36,000",-,"33,000",2020,2,28
2255,2020-03-02,"34,250","29,587","35,000","35,000","36,000",-,"31,000",2020,3,2
2256,2020-03-03,"34,250","29,790","35,000","35,000","36,000",-,"31,000",2020,3,3
2257,2020-03-04,"34,250","29,857","33,000","35,000","36,000",-,"33,000",2020,3,4
2258,2020-03-05,"35,250","29,907","35,000","35,000","36,000",-,"35,000",2020,3,5
2259,2020-03-06,"35,250","29,987","35,000","35,000","36,000",-,"35,000",2020,3,6

In [445]:
print("2020-02-20 광주 가격 : {}".format(price_merge.iloc[2248, 6]))

2020-02-20 광주 가격 : 25,000

In [438]:
price_merge.loc[2249: 2251, "광주"] = price_merge.iloc[2248, 6]

In [444]:
print("2020-03-07 광주 가격 : {}".format(price_merge.iloc[2260, 6]))

2020-03-07 광주 가격 : 35,000

In [440]:
price_merge.loc[2252: 2254, "광주"] = '30,000'

In [441]:
price_merge.loc[2255: 2259, "광주"] = price_merge.iloc[2260, 6]

In [442]:
price_merge[price_merge["광주"] == "-"]

Empty DataFrame
Columns: [일시, 평균, 평년, 서울, 부산, 대구, 광주, 대전, year, month, day]
Index: []

In [443]:
price_merge[price_merge["부산"] == "-"]

Empty DataFrame
Columns: [일시, 평균, 평년, 서울, 부산, 대구, 광주, 대전, year, month, day]
Index: []

In [446]:
price_merge["평균"] = price_merge["평균"].str.replace(pat = r",", repl = r"", regex = True).astype(int)
price_merge["평년"] = price_merge["평년"].str.replace(pat = r",", repl = r"", regex = True).astype(int)
price_merge["서울"] = price_merge["서울"].str.replace(pat = r",", repl = r"", regex = True).astype(int)
price_merge["부산"] = price_merge["부산"].str.replace(pat = r",", repl = r"", regex = True).astype(int)
price_merge["대구"] = price_merge["대구"].str.replace(pat = r",", repl = r"", regex = True).astype(int)
price_merge["광주"] = price_merge["광주"].str.replace(pat = r",", repl = r"", regex = True).astype(int)
price_merge["대전"] = price_merge["대전"].str.replace(pat = r",", repl = r"", regex = True).astype(int)

In [447]:
price_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2659 entries, 0 to 2658
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      2659 non-null   datetime64[ns]
 1   평균      2659 non-null   int64
 2   평년      2659 non-null   int64
 3   서울      2659 non-null   int64
 4   부산      2659 non-null   int64
 5   대구      2659 non-null   int64
 6   광주      2659 non-null   int64
 7   대전      2659 non-null   int64
 8   year    2659 non-null   object
 9   month   2659 non-null   object
 10  day     2659 non-null   object
dtypes: datetime64[ns](1), int64(7), object(3)
memory usage: 228.6+ KB

In [448]:
price_merge.drop(["year", "month", "day"], axis = 1, inplace = True)

In [449]:
price_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2659 entries, 0 to 2658
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      2659 non-null   datetime64[ns]
 1   평균      2659 non-null   int64
 2   평년      2659 non-null   int64
 3   서울      2659 non-null   int64
 4   부산      2659 non-null   int64
 5   대구      2659 non-null   int64
 6   광주      2659 non-null   int64
 7   대전      2659 non-null   int64
dtypes: datetime64[ns](1), int64(7)
memory usage: 166.3 KB

In [450]:
result_data = pd.merge(data_merge, price_merge, on = "일시", how = "outer")

In [451]:
result_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 28 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지점번호           3945 non-null   object
 1   지점명            3945 non-null   object
 2   일시             3945 non-null   datetime64[ns]
 3   평균기온(℃)        3945 non-null   float64
 4   최고기온(℃)        3945 non-null   float64
 5   최고기온시각         3945 non-null   object
 6   최저기온(℃)        3945 non-null   float64
 7   최저기온시각         3945 non-null   object
 8   일교차            3945 non-null   float64
 9   강수량(mm)        3945 non-null   float64
 10  1시간최다강수량(mm)   3945 non-null   float64
 11  1시간최다강수량시각     3945 non-null   object
 12  평균풍속(m/s)      3945 non-null   float64
 13  최대풍속(m/s)      3945 non-null   float64
 14  최대풍속풍향(deg)    3945 non-null   float64
 15  최대풍속시각         3945 non-null   object
 16  최대순간풍속(m/s)    3945 non-null   float64
 17  최대순간풍속풍향(deg)  3945 non-null   float64
 18  최대순간풍속시각       3945 non-null   object
 19  평균습도(%rh)      3945 non-null   float64
 20  최저습도(%rh)      3945 non-null   float64
 21  평균             2659 non-null   float64
 22  평년             2659 non-null   float64
 23  서울             2659 non-null   float64
 24  부산             2659 non-null   float64
 25  대구             2659 non-null   float64
 26  광주             2659 non-null   float64
 27  대전             2659 non-null   float64
dtypes: datetime64[ns](1), float64(20), object(7)
memory usage: 893.8+ KB

In [452]:
result_data = result_data.fillna(method = "ffill")
result_data = result_data.fillna(method = "bfill")

In [453]:
result_data[result_data["평균"].isnull()]

Empty DataFrame
Columns: [지점번호, 지점명, 일시, 평균기온(℃), 최고기온(℃), 최고기온시각, 최저기온(℃), 최저기온시각, 일교차, 강수량(mm), 1시간최다강수량(mm), 1시간최다강수량시각, 평균풍속(m/s), 최대풍속(m/s), 최대풍속풍향(deg), 최대풍속시각, 최대순간풍속(m/s), 최대순간풍속풍향(deg), 최대순간풍속시각, 평균습도(%rh), 최저습도(%rh), 평균, 평년, 서울, 부산, 대구, 광주, 대전]
Index: []

[0 rows x 28 columns]

In [454]:
result_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3945 entries, 0 to 3944
Data columns (total 28 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지점번호           3945 non-null   object
 1   지점명            3945 non-null   object
 2   일시             3945 non-null   datetime64[ns]
 3   평균기온(℃)        3945 non-null   float64
 4   최고기온(℃)        3945 non-null   float64
 5   최고기온시각         3945 non-null   object
 6   최저기온(℃)        3945 non-null   float64
 7   최저기온시각         3945 non-null   object
 8   일교차            3945 non-null   float64
 9   강수량(mm)        3945 non-null   float64
 10  1시간최다강수량(mm)   3945 non-null   float64
 11  1시간최다강수량시각     3945 non-null   object
 12  평균풍속(m/s)      3945 non-null   float64
 13  최대풍속(m/s)      3945 non-null   float64
 14  최대풍속풍향(deg)    3945 non-null   float64
 15  최대풍속시각         3945 non-null   object
 16  최대순간풍속(m/s)    3945 non-null   float64
 17  최대순간풍속풍향(deg)  3945 non-null   float64
 18  최대순간풍속시각       3945 non-null   object
 19  평균습도(%rh)      3945 non-null   float64
 20  최저습도(%rh)      3945 non-null   float64
 21  평균             3945 non-null   float64
 22  평년             3945 non-null   float64
 23  서울             3945 non-null   float64
 24  부산             3945 non-null   float64
 25  대구             3945 non-null   float64
 26  광주             3945 non-null   float64
 27  대전             3945 non-null   float64
dtypes: datetime64[ns](1), float64(20), object(7)
memory usage: 893.8+ KB

In [455]:
result_data.to_csv("../CSV/result.csv", index = False)